using System;
using System.Collections.Generic;
using System.Linq;
using System.Text;
using System.Threading.Tasks;

namespace nilnul._time._date.calendar_._lunar
{
	/// ccal.chinesebay.com/ccal/rule.htm
	/// <summary>
	/// 首先阴历以月为基本单位，一个月以新月出现的那一天为始直至下一个新月出现的前一天。所有新月和节气出现时刻的计算以北京时间为准。现北京时间为东经１２０度即东八区标准时。但计算１９２９年以前的阴历时应以北京即东经１１６度２５分的当地时为准。此条规则用以区分中国阴历和其他类似阴历如日本阴历。
	/// 
	/// 由于月亮公转的周期介于２９到３０天之间，阴历的一个月也就由新月出现时刻的早晚或是２９天或是３０天。大月为３０天，小月为２９天。与阳历不同的是，大小月在不同的年中不固定。如春节的前一天常称为大年三十，但有不少年如２０００年的阴历十二月只有２９天。
	/// 由于十二个月的时间较阳历年即地球绕太阳公转一周的时间短１１天左右，为了使阴历年与阳历年保持相对稳定，每隔两三年就需要加入一个闰月。大约每十九年要加入七个闰月。
	///
	/// 每年的冬至总是出现在这年的阴历十一月中。
	/// 从一年的冬至后一天起到下一年冬至这一天止的这段时间中，下称其间，如有十三个新月出现，则其间要加入一个闰月。需要加入闰月时，其间第一个没有中气的月为闰月。因为其间只有十二个中气，所以其间至少有一个月没有中气，也存在有两个月没有中气的可能性。但这种情况下只有第一个没有中气的月为闰月。闰月的前一个月为几月则该闰月称为闰几月。
	/// </summary>
	/// <remarks>
	///
	/// </remarks>
	/// 干支除了纪年，还可以记月、日、时，四个干支合起来就是生辰八字
	internal class Month
	{
	}
}
